In [1]:
import pandas as pd

In [2]:
dict1 = {'Name':['Priyang', 'Aadhya', 'Krisha', 'Vedant', 'Parshv', 
                 'Mittal', 'Archana'],
         'Marks':[98,89,99,87,90,83,99], 
         'Gender':['Male', 'Female', 'Female', 'Male', 'Male',
                   'Female', 'Female']}
df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [22]:
# 1. Display first 3 rows of the dataset
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [21]:
# 2. Display last 3 rows of the dataset
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [20]:
# 3. Find the shape, rows and columns of the dataset
print('Shape:', df1.shape)
print("Rows:", df1.shape[0])
print("Columns:", df1.shape[1])

Shape: (7, 3)
Rows: 7
Columns: 3

In [19]:
# 4. Get information about the dataset
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [18]:
# 5. Check for any null values
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [26]:
# 6. Obtain statistical information of the dataset. 
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [23]:
# 7. Find unique values from the gender column 
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [27]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [30]:
# 8. Find the number of unique values from the gender column
df1['Gender'].nunique()

2

In [31]:
# 9. Display count of unique values from gender column
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [36]:
# 10. Find the total number of students having marks between 90 and 100
df1[(df1['Marks'] >= 90) & (df1['Marks'] <= 100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [40]:
df1['Marks'].between(90,100) # both inclusive in between()

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [41]:
# 11. Find average marks
df1['Marks'].mean()

92.14285714285714

In [59]:
# 12. Apply method
def marks(x): 
    return x/2

In [60]:
df1['Marks'].apply(marks) # our function name without ()

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [61]:
df1['Half_marks'] = df1['Marks'].apply(marks)
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [62]:
df1['Marks'].apply(lambda x:x//2)
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [63]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [64]:
# 13. Map function 
# Converting Male to 0 and Female to 1 
df1['M/F'] = df1['Gender'].map({'Male':0, 'Female':1})
df1

      Name  Marks  Gender  Half_marks  M/F
0  Priyang     98    Male        49.0    0
1   Aadhya     89  Female        44.5    1
2   Krisha     99  Female        49.5    1
3   Vedant     87    Male        43.5    0
4   Parshv     90    Male        45.0    0
5   Mittal     83  Female        41.5    1
6  Archana     99  Female        49.5    1

In [65]:
# 14. Drop the column(s) 
df1.drop(['Half_marks', 'M/F'], axis=1, inplace=True) # applying axis is necessary
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [67]:
# 15. Print names of the columns 
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [68]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [72]:
# 16. Sort the dataframe as per the marks column 
df1.sort_values(by='Marks', ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [73]:
df1.sort_values(by=['Marks', 'Gender'], ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [76]:
# 17. Display name and marks of the female students 
df1[df1['Gender'] == 'Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [79]:
df1[df1['Gender'].isin(['Female'])][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99